{
  "data": [
    {
      "id": 4614,
      "name": "NCIS",
      "first_air_date": "2003-09-23",
      "last_air_date": "2019-05-21",
      "number_of_episodes": 379,
      "poster": "poster_ncis.webp",
      "backdrop": "https://image.tmdb.org/t/p/w1280/nymeWHYQ1JaWP2wyNW5a5WHiDCd.jpg",
      "vote_average": 6.7,
      "original_language": "en",
      "status": "Returning Series",
      "overview": "From murder and espionage to terrorism and stolen submarines, a team of special agents investigates any crime that has a shred of evidence connected to Navy and Marine Corps personnel, regardless of rank or position."
    },
    {
      "id": 1412,
      "name": "Arrow",
      "first_air_date": "2012-10-10",
      "last_air_date": "2019-05-13",
      "number_of_episodes": 160,
      "poster": "poster_arrow.webp",
      "backdrop": "https://image.tmdb.org/t/p/w1280/dKxkwAJfGuznW8Hu0mhaDJtna0n.jpg",
      "vote_average": 5.8,
      "original_language": "en",
      "status": "Returning Series",
      "overview": "Spoiled billionaire playboy Oliver Queen is missing and presumed dead when his yacht is lost at sea. He returns five years later a changed man, determined to clean up the city as a hooded vigilante armed with a bow."
    },
    {
      "id": 79501,
      "name": "Doom Patrol",
      "first_air_date": "2019-02-15",
      "last_air_date": "2019-05-24",
      "number_of_episodes": 15,
      "poster": "poster_doom_patrol.webp",
      "backdrop": "https://image.tmdb.org/t/p/w1280/sAzw6I1G9JUxm86KokIDdQeWtaq.jpg",
      "vote_average": 6.1,
      "original_language": "en",
      "status": "Returning Series",
      "overview": "The Doom Patrol’s members each suffered horrible accidents that gave them superhuman abilities — but also left them scarred and disfigured. Traumatized and downtrodden, the team found purpose through The Chief, who brought them together to investigate the weirdest phenomena in existence — and to protect Earth from what they find."
    },
    {
      "id": 12609,
      "name": "Dragon Ball",
      "first_air_date": "1986-02-26",
      "last_air_date": "1989-04-19",
      "number_of_episodes": 153,
      "poster": "poster_dragon_ball.webp",
      "backdrop": "https://image.tmdb.org/t/p/w1280/iflq7ZJfso6WC7gk9l1tD3unWK.jpg",
      "vote_average": 7.1,
      "original_language": "ja",
      "status": "Ended",
      "overview": "Long ago in the mountains, a fighting master known as Gohan discovered a strange boy whom he named Goku. Gohan raised him and trained Goku in martial arts until he died. The young and very strong boy was on his own, but easily managed. Then one day, Goku met a teenage girl named Bulma, whose search for the dragon balls brought her to Goku's home. Together, they set off to find all seven dragon balls in an adventure that would change Goku's life forever. See how Goku met his life long friends Bulma, Yamcha, Krillin, Master Roshi and more."
    },
    {
      "id": 60735,
      "name": "The Flash",
      "first_air_date": "2014-10-07",
      "last_air_date": "2019-05-14",
      "number_of_episodes": 115,
      "poster": "poster_flash.webp",
      "backdrop": "https://image.tmdb.org/t/p/w1280/jC1KqsFx8ZyqJyQa2Ohi7xgL7XC.jpg",
      "vote_average": 6.7,
      "original_language": "en",
      "status": "Returning Series",
      "overview": "After a particle accelerator causes a freak storm, CSI Investigator Barry Allen is struck by lightning and falls into a coma. Months later he awakens with the power of super speed, granting him the ability to move through Central City like an unseen guardian angel. Though initially excited by his newfound powers, Barry is shocked to discover he is not the only \\\"meta-human\\\" who was created in the wake of the accelerator explosion -- and not everyone is using their new powers for good. Barry partners with S.T.A.R. Labs and dedicates his life to protect the innocent. For now, only a few close friends and associates know that Barry is literally the fastest man alive, but it won't be long before the world learns what Barry Allen has become...The Flash."
    },
    {
      "id": 1399,
      "name": "Game of Thrones",
      "first_air_date": "2011-04-17",
      "last_air_date": "2019-05-19",
      "number_of_episodes": 73,
      "poster": "poster_god.webp",
      "backdrop": "https://image.tmdb.org/t/p/w1280/qsD5OHqW7DSnaQ2afwz8Ptht1Xb.jpg",
      "vote_average": 8.1,
      "original_language": "en",
      "status": "Ended",
      "overview": "Seven noble families fight for control of the mythical land of Westeros. Friction between the houses leads to full-scale war. All while a very ancient evil awakens in the farthest north. Amidst the war, a neglected military order of misfits, the Night's Watch, is all that stands between the realms of men and icy horrors beyond."
    },
    {
      "id": 31910,
      "name": "Naruto Shippūden",
      "first_air_date": "2007-02-15",
      "last_air_date": "2017-03-23",
      "number_of_episodes": 500,
      "poster": "poster_naruto_shipudden.webp",
      "backdrop": "https://image.tmdb.org/t/p/w1280/c14vjmndzL9tBdooGsMznMFrFLo.jpg",
      "vote_average": 7.5,
      "original_language": "ja",
      "status": "Ended",
      "overview": "Naruto Shippuuden is the continuation of the original animated TV series Naruto.The story revolves around an older and slightly more matured Uzumaki Naruto and his quest to save his friend Uchiha Sasuke from the grips of the snake-like Shinobi, Orochimaru. After 2 and a half years Naruto finally returns to his village of Konoha, and sets about putting his ambitions to work, though it will not be easy, as He has amassed a few (more dangerous) enemies, in the likes of the shinobi organization; Akatsuki."
    },
    {
      "id": 34307,
      "name": "Shameless",
      "first_air_date": "2011-01-09",
      "last_air_date": "2019-03-10",
      "number_of_episodes": 110,
      "poster": "poster_shameless.webp",
      "backdrop": "https://image.tmdb.org/t/p/w1280/zjOj2gnDJYFdYt6R7FtuHn7yrPr.jpg",
      "vote_average": 7.8,
      "original_language": "en",
      "status": "Returning Series",
      "overview": "Chicagoan Frank Gallagher is the proud single dad of six smart, industrious, independent kids, who without him would be... perhaps better off. When Frank's not at the bar spending what little money they have, he's passed out on the floor. But the kids have found ways to grow up in spite of him. They may not be like any family you know, but they make no apologies for being exactly who they are."
    },
    {
      "id": 62688,
      "name": "Supergirl",
      "first_air_date": "2015-10-26",
      "last_air_date": "2019-05-19",
      "number_of_episodes": 87,
      "poster": "poster_supergirl.webp",
      "backdrop": "https://image.tmdb.org/t/p/w1280/3x1lVyxtsLKsZyR2E3qRe1EAXG4.jpg",
      "vote_average": 5.8,
      "original_language": "en",
      "status": "Returning Series",
      "overview": "Twenty-four-year-old Kara Zor-El, who was taken in by the Danvers family when she was 13 after being sent away from Krypton, must learn to embrace her powers after previously hiding them. The Danvers teach her to be careful with her powers, until she has to reveal them during an unexpected disaster, setting her on her journey of heroism."
    },
    {
      "id": 1622,
      "name": "Supernatural",
      "first_air_date": "2005-09-13",
      "last_air_date": "2019-04-25",
      "number_of_episodes": 307,
      "poster": "poster_supernatural.webp",
      "backdrop": "https://image.tmdb.org/t/p/w1280/o9OKe3M06QMLOzTl3l6GStYtnE9.jpg",
      "vote_average": 7.3,
      "original_language": "en",
      "status": "Returning Series",
      "overview": "When they were boys, Sam and Dean Winchester lost their mother to a mysterious and demonic supernatural force. Subsequently, their father raised them to be soldiers. He taught them about the paranormal evil that lives in the dark corners and on the back roads of America ... and he taught them how to kill it. Now, the Winchester brothers crisscross the country in their '67 Chevy Impala, battling every kind of supernatural threat they encounter along the way."
    },
    {
      "id": 456,
      "name": "The Simpsons",
      "first_air_date": "1989-12-17",
      "last_air_date": "2019-05-12",
      "number_of_episodes": 662,
      "poster": "poster_the_simpson.webp",
      "backdrop": "https://image.tmdb.org/t/p/w1280/1pP0gg0iNGX06wSs19EQOvzfZIF.jpg",
      "vote_average": 7.1,
      "original_language": "en",
      "status": "Returning Series",
      "overview": "Set in Springfield, the average American town, the show focuses on the antics and everyday adventures of the Simpson family; Homer, Marge, Bart, Lisa and Maggie, as well as a virtual cast of thousands. Since the beginning, the series has been a pop culture icon, attracting hundreds of celebrities to guest star. The show has also made name for itself in its fearless satirical take on politics, media and American life in general."
    }
  ]
}